test/dummy/app/controllers/registrations_controller.rb

  def create
    @user = User.new(registration_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email_address", "password_digest", "updated_at") VALUES ('2026-08-20 05:31:11.810402', 'test@example.com', '$2a$12$7BqpjLnr8550NZMFoK9R4ubmRGADIvqpdXMmc8DUJBe0VS8TRkVh.', '2026-08-20 05:31:11.810402') RETURNING "id"

  def update
    @user = Current.user
    @user.current_password = params.dig(:user, :current_password)

    unless @user.authenticate(@user.current_password.to_s)
      @user.errors.add(:base, "Current password is incorrect.")

      return render "rails_den/registrations/edit",
                    status: :unprocessable_entity
    end

    attributes = account_params.to_h.symbolize_keys

    if attributes[:password].blank?
      attributes.delete(:password)
      attributes.delete(:password_confirmation)
    end

    if @user.update(attributes)
---
UPDATE "users" SET "email_address" = 'john@oakharborventures.com', "updated_at" = '2026-08-20 05:37:02.734048' WHERE "users"."id" = 1